tap "thoughtbot/formulae"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# Unix
brew "universal-ctags", args: ["HEAD"]
brew "git"
brew "openssl"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "fzf"
brew "neovim"
brew "watchman"
brew "zsh"

# GitHub
brew "hub"

# Image manipulation
brew "ffmpeg"

# Programming languages and package managers
brew "libyaml" # should come after openssl
brew "node"
brew "nvm"

# Casks
cask "raycast"
cask "figma"
cask "google-chrome"
cask "ghostty"
cask "1password"
cask "nikitabobko/tap/aerospace"

