tap "thoughtbot/formulae"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# Unix
brew "universal-ctags", args: ["HEAD"]
brew "git"
brew "openssl"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"

# Making the switch to neovim
# brew "vim"
brew "neovim"
brew "watchman"
brew "zsh"

# GitHub
brew "hub"

# Image manipulation
brew "ffmpeg"

# Programming languages and package managers
brew "libyaml" # should come after openssl
brew "node"
brew "nvm"
brew "clojure/tools/clojure"

# Casks
cask "processing"
cask "hammerspoon"
cask "nextcloud"
cask "macpass"
cask "cyberduck"
cask "hyper"
cask "todoist"
cask "selfcontrol"
cask "figma"
